benchmark_results/results/gptoss120b/openai_gpt-oss-120b_in20000_out5000_rate1.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7ff9823449a0>, trust_remote_code=False, seed=0, num_prompts=10, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='openai/gpt-oss-120b', input_len=20000, output_len=5000, tokenizer='./gpt-oss-120b', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-c17606e6-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 04-15 11:32:52 [datasets.py:700] Sampling input_len from [20000, 20000] and output_len from [5000, 5000]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1

  0%|          | 0/10 [00:00<?, ?it/s]
 10%|█         | 1/10 [00:22<03:19, 22.14s/it]
 20%|██        | 2/10 [00:44<02:57, 22.14s/it]
 30%|███       | 3/10 [01:06<02:34, 22.13s/it]
 40%|████      | 4/10 [01:29<02:14, 22.50s/it]
 50%|█████     | 5/10 [01:54<01:57, 23.41s/it]
 60%|██████    | 6/10 [02:16<01:31, 22.97s/it]
 70%|███████   | 7/10 [02:38<01:08, 22.69s/it]
 80%|████████  | 8/10 [03:00<00:45, 22.51s/it]
 90%|█████████ | 9/10 [03:22<00:22, 22.39s/it]
100%|██████████| 10/10 [03:49<00:00, 23.52s/it]
100%|██████████| 10/10 [03:49<00:00, 22.90s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     10        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  217.02    
Total input tokens:                      200000    
Total generated tokens:                  50000     
Request throughput (req/s):              0.05      
Output token throughput (tok/s):         230.39    
Peak output token throughput (tok/s):    239.00    
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          1151.94   
---------------Time to First Token----------------
Mean TTFT (ms):                          693.49   
Median TTFT (ms):                        703.00   
P99 TTFT (ms):                           713.56   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          4.20     
Median TPOT (ms):                        4.20      
P99 TPOT (ms):                           4.26      
---------------Inter-token Latency----------------
Mean ITL (ms):                           4.30      
Median ITL (ms):                         3.91      
P99 ITL (ms):                            13.96      
==================================================